[
    {
        "title": "[Video Games] The Xbox One: How Microsoft cost themselves an entire console generation with one bad announcement after another",
    "bodyText": "Console wars have always been a part of video games, going all the way back to the 90s with the feud between Sega and Nintendo. It makes sense from a tribalism perspective; consoles are hefty purchases so you need to be able to feel secure that you bought the right one, especially if you're a child as you may not have the funds to secure the competition unless your parents were exceedingly generous. Today's post focuses on one such entry into the console war, and how focusing on the wrong aspects cost its parent company the entire generation in terms of PR and public image. This is the story of the Xbox One.",
    "userId":"647b712e0790ea734bcca1b5",
    "groupId":"64847442404a2b77e9f913cc"
     },
     {
        "title": "Xbox Series X after two weeks from a (former) PC Gamer (Even Longer!)",
    "bodyText": "So around ten months ago I posted something here discussing why, as a PC gamer, I'm moving on to the Series X. You can read it here if you're interested. Quick version, I've been exclusively a PC gamer for over fifteen years and got kinda tired of the PC for various reasons. I discussed why I was choosing the Series X over the competition. It was mostly created as a way to start a conversation as to why PC gamers might prefer to switch to the Series X over getting a new PC or upgrading.Well A LOT has changed since then, and I won't lie I jumped back and forth a thousand times between the Series X, PS5, and a new PC. My decision changed every day but in the end I kept going back to the Series X because it appealed to me a lot more. In the end, a hardware shortage on the PC that makes the shortage of consoles pale in comparison sealed the deal. Suddenly, it went from needing to spend 3-4 times as much to upgrade my PC over buying a console, to needing to spend 7-9 times as much. To get just one part I needed, it would have cost the entire price of a brand new PC. Knowing the right person at the right place got me a Series X at retail price plus one large pizza, so lucky me. So I wanted to come on here and see if anyone was interested in an update and maybe start a discussion on this. I'll start with some likes and dislikes and then go into further detail about things that have been important to me and how I like them in relation to the PC.",
    "userId":"647b712e0790ea734bcca1bc",
    "groupId":"64847442404a2b77e9f913cc"
     },
     {
        "title": "Warframe is coming to PlayStation 5 and Xbox Series X!",
    "bodyText": "Warframe is Bullet Jumping onto the next generation of consoles. Our journey begins on PlayStation 5 later this year, and we’ll have more information to share about the Xbox Series X very soon. When Warfarme launched in 2013, we knew we were committed to supporting it for a long time, and we are so grateful to you for helping Warframe thrive. The Origin System has grown so much since we first launched on consoles, and we can’t wait to start the next chapter on PlayStation 5 and Xbox Series X.",
    "userId":"647b712e0790ea734bcca1b5",
    "groupId":"64847442404a2b77e9f913cc"
     },
     {
        "title": "I've finally decided to pursue my true passion in life: create/develop my own video games!",
    "bodyText": "This past September, I went to the hospital as I was suffering from lower back pain. After running extensive tests, my oncologist informed me of their results: they diagnosed me with stage 4 stomach cancer. To say the news devastated me is an understatement. I couldn’t stop crying, knowing full well my life was reaching its end. During my time in the hospital, family members came by to visit me, reminding me to keep a positive attitude. I even spoke to a chaplain several times, explaining my life story and airing out my grievances. He also reminded me to keep a positive attitude. During this time, I came across a specific YouTube channel that incorporates amazing, life altering, positive messages; it has become my favorite channel to watch. I understood with a positive mindset, I can do anything in life. As I was undergoing my first chemotherapy treatment, I closed my eyes and prayed to God. I was going to beat this cancer no matter what. After my second treatment, they released me to go home. I continued with my chemotherapy once every two weeks, as per my oncologist’s orders. Halfway through, I had a CAT scan done to see the progress of my treatments. You know what the results showed? 50% of the cancer is gone! I knew I couldn’t give up because of this news. This proves I have not lived my life to its fullest potential. While growing up, I used to love drawing everything, from video game characters and comic book superheroes to still life. When Jurassic Park came out in 1993, my family and I went to the theaters to watch the movie. There I was sitting, with my mouth agape, staring in amazement at how realistic the CG dinosaurs looked. I then shifted course in learning everything about 3D computer animation. I thought I found something I was going to move forward with; within a year, I gave up interest in it. During my childhood, there was one thing I kept going back to escape from my troubles: playing video games. I remember how thrilled I was when we first got the original Nintendo Entertainment System back in 1987. In 1991, our next purchase was the Sega Genesis; the coming year we bought the Super Nintendo. Several years afterward, we got the PlayStation and Nintendo 64. With each new generation of game consoles, we purchased the latest and greatest, whether it was from Sony, Microsoft or Nintendo. To this day, I play video games because it’s what I love to do. However, the industry is remastering games, crafting sequels with minimal effort or concentrating on developing online multiplayer games. It’s become so uninteresting I’m giving up on my favorite hobby. Going through my eighth treatment, I opened the YouTube app and found watching one of the latest videos from my favorite channel. In this one, they reiterated a specific adage which is found in several videos: “What you believe, you can achieve.” It was then I finally had an epiphany: why not create my own 2D pixel-art style video game for the current generation? There’s been an increase in these types of games within the last few years, but still lack the polish and heart found from the old days. I decided this is what I’m supposed to do with my life; my genuine passion is to create and develop video games. In today’s world, we are seeing a massive increase of open source software being developed and released to the public, especially in the video game industry (except for GameMaker Studio 2 and FL Studio, which I currently own and will use in developing this game). These tools have provided me the drive to fulfill my dreams. My major goal is to create a 2D side-scrolling Horror Action Platformer using a 16-bit high color palette (65,536 colors total, 256 colors on screen at once). The music will be a darksynth soundtrack found in artists of the genre like Perturbator, DANCE WITH THE DEAD, Gregorio Franco and DEADLIFE. Also, it’s going to mimic the graphical styles and high-level details found in games like Garou: Mark of the Wolves, Chrono Trigger, Thunder Force IV and The King of Fighters 2003. Art style wise (for the main character, enemies, sub-bosses and end bosses), none other than Bruce Timm himself will inspire it. At the moment, my target platforms are Windows, macOS and Linux (I am developing this game on Pop!_OS, a Linux Debian-based OS) for Steam, GOG and itch.io. Depending on the game’s success, I will then work on a port for the PlayStation 4, PlayStation 5, Switch, Xbox One and Xbox Series X/S. I know this will be a bumpy ride from beginning to end, but as long as I’m still breathing and with a positive attitude, I’ll be able to fulfill my dream of creating/developing this game.",
    "userId":"647b712e0790ea734bcca1ba",
    "groupId":"64847442404a2b77e9f913cc"
     },
     {
        "title": "[Video Games] The Playstation Vita: A Tumultuous History Of Sony’s Failed and Final Handheld",
    "bodyText": "By the early 2010s, cell phones had well and truly taken off in the mainstream as devices like the iPhone and Samsung Galaxy saw enormous sales success. With these technological innovations, games developed specifically for cellular devices began to explode in popularity as they became easier to develop and build. Soon enough, mobile gaming would take hold well before the first half of the decade, and to this day dwarfs the game industry in revenue each year. Amidst all this, the console wars were still ongoing, and Nintendo and Sony were both eager to announce their successors to the DS and Playstation Portable (PSP) respectively. The seventh generation had seen handheld gaming grow to greater heights than ever before, with the DS eventually attaining over 150 million units sold by the end of its lifespan. Though the PSP wouldn’t quite garner the same amount of success (whether that be due to piracy, the comparatively higher price point, Nintendo’s IP popularity, or a whole host of other possible issues), it still managed a solid 80 million units sold by the end of its run. With a decent performance for its first outing in the handheld console market, Sony would go all in for the PSP’s successor. Unfortunately, Sony would not see a repeat of its initial success. The Playstation Vita would go down as the worst performing console Playstation ever released, and almost single handedly kill any new attempt from the company at reentering the handheld console market.",
    "userId":"647b712e0790ea734bcca1b6",
    "groupId":"64847442404a2b77e9f913cc"
     },
     {
        "title": "Will Xbox Series X have Console sharing/Game sharing?",
    "bodyText": "I'm being told that there is a 5 time limit on the amount of times you can change your home console. So if you're seeing issues where you both can't play the same game. That could be it. I'm sure a call to Xbox support could rectify that limit, but I envision some sort of fee to do so (sort of like how your first gamertag name change is free; but there's a cost after that). Just try and keep that 5 times limit when setting this all back up with your friends and family. The wording might be slightly different due to the UI being updated multiple times since this was written, but you should be able to manage. Anyways, my friend (that I console share with) got the Series X before I did and I'm still on the One X so we just had to re-do it all today. So once we were done it was giving us weird messages on how I had to end his session of the game because we both couldn't play or something like that. We both hard reseted our consoles (hold the power button down on the console for 8 seconds, then start console back up). It worked now. My friend also brought up the point that the next gen 'quick resume' functionality could be getting in the way. So he completely closed the game down. So maybe try that if it doesn't work after hard reset. Just be mindfully that quick resume could be getting in the way and causing problems. Be prepared to have to fully close a game down every time, until a patch comes or something.",
    "userId":"647b712e0790ea734bcca1b6",
    "groupId":"64847442404a2b77e9f913cc"
     },
     {
        "title": "Days Gone was a game I didn't know I needed and helped put modern video games into perspective.",
    "bodyText": "So real quick: I'm a 40-year-old white guy who's been gaming since the 1980's with the Atari 2600. Eventually moved on to Nintendo, Super Nintendo, jumped over to Playstation 1, played Playstation 2 in College, also moved on to PC gaming in college, and never looked back. I have a switch but that's more for my wife. Oh yeah, I also have a career, a house, and a kid in pre-school so my gaming habits have grossly declined in the past 6 or so years, so when I play a game, it has to be something I'm interested in, preferebly single-player long-form games. I just finished Days Gone last night, and simply put, it is one of the best new games I've played in a long, long time. Sure there were flaws, but the good far outweighs the bad and made me take a good, hard look at video gaming in my lifetime (more on the title in a bit). So real quick: I'm a 40-year-old white guy who's been gaming since the 1980's with the Atari 2600. Eventually moved on to Nintendo, Super Nintendo, jumped over to Playstation 1, played Playstation 2 in College, also moved on to PC gaming in college, and never looked back. I have a switch but that's more for my wife. Oh yeah, I also have a career, a house, and a kid in pre-school so my gaming habits have grossly declined in the past 6 or so years, so when I play a game, it has to be something I'm interested in, preferebly single-player long-form games. I just finished Days Gone last night, and simply put, it is one of the best new games I've played in a long, long time. Sure there were flaws, but the good far outweighs the bad and made me take a good, hard look at video gaming in my lifetime (more on the title in a bit). Some things are better as a one-off & I think Days Gone will eventually become that diamond in the rough people talk about years later. My time in gaming is getting more & more finite, but if I'm able to play more games like Days Gone, then I feel I'll be ending it on a high note.",
    "userId":"647b712e0790ea734bcca1b9",
    "groupId":"64847442404a2b77e9f913cc"
     },
     {
        "title": "Neither the Playstation 5 nor the Xbox Series X have launch titles that merit a $500 purchase.",
    "bodyText": "Been looking for a reason to get a PS5 or XSX at launch, and while everyone is freaking out over pre-orders and eBay listings... I'm looking at the games.None of these games make me go 'Oh, crap, yeah, I'd pay $500 to play that...' Spider-Man: Miles Morales will be out on the PS4 I already own and the gameplay videos do not look significantly different from the original PS4 game a few years ago. Same for Assassin's Creed: Valhalla. Coming on my Xbox One X with a free upgrade to the XSX. Godfall could be cool, but again looks like a PS4 title. We aren't getting an enhanced version of CyberPunk 2077 until 2021. Halo Infinite is delayed until 2021. Horizon: Forbidden West is 2021. Stray is 2021. Deathloop is delayed until 2021. No dates at all for Everwild or Fable. 2021 if we're lucky, I guess... Most of the games Microsoft has shown have been on Game Pass which means I can play them on the Xbox One X I already own... But frankly, the Game Pass games for the most part look like crap I wouldn't waste the bandwidth to download. I mean, seriously... have you seen the clips for As Dusk Falls? Tell Me Why? So... yeah... I have the money, I'd love to spend it, but I'm not seeing a real reason until next year.",
    "userId":"647b712e0790ea734bcca1bc",
    "groupId":"64847442404a2b77e9f913cc"
     },




     {
        "title": "What was your reaction when u saw this in either manga or anime??",
    "bodyText": "Sasuke was trolled and itachi on throne... Ngl that was one of the most hype moments of the show",
    "userId":"647b712e0790ea734bcca1b6",
    "groupId":"64847442404a2b77e9f913cd"
     },
     {
        "title": "Should martials feel like anime characters?",
    "bodyText": "Basically title. I personally feel like they should; in the sense that they should all be capable of pulling insane feats. I'd say they already kinda do, in the sense of finesse, speed, and raw strength, but, I'm thinking they should all be able to do way more weird shit. Super long jumps, bursts of massive speed, that kinda thing. Edit - I think me saying 'anime' has set a certain kind of expectation for everyone. I don't necessarily mean anime concepts, I'm moreso on about just the kind of ridiculous power levels you'd see in anime.",
    "userId":"647b712e0790ea734bcca1bd",
    "groupId":"64847442404a2b77e9f913cd"
     },
     {
        "title": "How many of you are over 30 and still enjoy watching anime?",
    "bodyText": "Recently had a few burnouts from my hobbies. Stopped gaming, watching any media for good few months. Tried it out again on and off but was completely uninterested. Started working recently and i barely have any time for myself. Now I'm sometimes able to watch a few episodes or play some games rarely. Just wondering how it goes for older people.",
    "userId":"647b712e0790ea734bcca1bd",
    "groupId":"64847442404a2b77e9f913cd"
     },
     {
        "title": "Regardless of your gripes with the show. Susanoos are one of the coolest things in Anime.",
    "bodyText": "",
    "userId":"647b712e0790ea734bcca1b6",
    "groupId":"64847442404a2b77e9f913cd"
     },
     {
        "title": "Saddest anime u have ever watched?",
    "bodyText": "Hi so I honestly just want to watch an anime where I can cry and don’t get judge for crying out any recommendations? (The saddest anime which I can remember shedding a tear is violet evergarden)",
    "userId":"647b712e0790ea734bcca1b6",
    "groupId":"64847442404a2b77e9f913cd"
     },
     {
        "title": "I made a website to insult your taste in anime",
    "bodyText": "Ever found out that the person you're speaking to watches anime? You ask them what anime they like and they say they like FMA:B, Steins;Gate, and Violet Evergarden. What does that tell you about them? Absolutely nothing. But, just as an example, if they said they liked the ending of Darling in the Franxx, now you've got something to talk about. The unpopular/bad opinions we hold say much more about our taste than our mainstream opinions. But how do you identify which of your takes are the spiciest? I have spent the last ~6 months building WrongOpinions. moe, a website that finds your worst (but hopefully most interesting) opinions and displays them in an easily-sharable image, complete with plenty of playful insults. All you need is a MAL account with a public animelist. The website is completely free to use and doesn't have any ads, and I promise to keep it that way. This is just a hobby project, not something I intend to monetise. If you're a developer, the whole project is open source (GPL) so feel free to read through the code or even use it as a starting point for building your own site. Share your own scorecard in the comments, let's compete for baka scores and learn a bit about each other.",
    "userId":"647b712e0790ea734bcca1ba",
    "groupId":"64847442404a2b77e9f913cd"
     },
     {
        "title": "What’s your favorite “turn off your brain and enjoy” anime?",
    "bodyText": "There are times when you just don’t wanna watch a show with a serious, complex plot. Maybe you just got off work, back home from school or you’re chillin on a lazy Sunday. All you want is something that you can just sit back or roll up in bed and enjoy. For me, that anime is probably “Rosario + Vampire.” I know that the plot is nonexistent but it’s like the perfect mix of comedy, action and ecchi fun. I’d throw “Yuuna and the Haunted Hot Springs” in there too. What about you? What’s your favorite anime for whenever you just wanna turn off your brain and enjoy something fun?",
    "userId":"647b712e0790ea734bcca1b7",
    "groupId":"64847442404a2b77e9f913cd"
     },
     {
        "title": "Mob Psycho 100 has ruined anime for me.",
    "bodyText": "That's it. That's the post. I cannot find another anime nearly as good as Mob Psycho 100, and frankly I don't think I want to nor will. Season 2 is one of the best seasons of any show I've ever watched. I can't enjoy anime anymore because I keep comparing it to MP100 and thinking how stretched and unrealistic [insert anime] is when compared to the realism and actual relatable struggles the characters in this show go through. No fan service, no pacing issues, no plot armor, almost no filler, just good animation, characters, OST, and plot. I'm depressed just thinking about how I'll never fully enjoy a new anime again. To anyone reading this who may have contributed to the success of Mob Psycho, thank you so damn much for your service, and I hope you stub your toe.",
    "userId":"647b712e0790ea734bcca1b8",
    "groupId":"64847442404a2b77e9f913cd"
     },
     {
        "title": "Got clocked going to the bathroom at an anime convention",
    "bodyText": "My sister and I were shopping the dealer's corner at Momocon and I had to use the restroom. I had her hold my stuff and wait outside while I used the women's, the same one I've been using for the past year. Now I'm pretty confident in my appearance these days, much more so than when I started HRT a year and a half ago. I don't think anyone has clocked me in months. I'm addressed as a woman when I go out, in the workplace, etc. As I'm going to enter I notice that there's two bathroom attendants(bouncers?) kinda standing in front of the doorways. I slip past and hear the guy say, 'oh a boy just went into the girl's room.' The lady was like, 'no I think that was a woman.' It made me very uncomfortable. So I'm waiting in line for a stall to open and the woman follows me in, kinda lingers and stares at me for a bit, and then just leaves. I do my business completely mortified, wash my hands, and walk out. I couldn't believe this happened to me. I guess maybe I had kind of an androgynous outfit today, but it completely filled my head with dysphoria. I had to leave my sister behind so I could go back to the hotel and cry.",
    "userId":"647b712e0790ea734bcca1be",
    "groupId":"64847442404a2b77e9f913cd"
     },
     {
        "title": "Which Anime Protagonist dies/fails earliest in their series without plot armor/convenience?",
    "bodyText": "Using this description of Plot Armor: used to refer to the phenomenon in fiction whereby the main character is allowed to survive dangerous situations because they are needed for the plot to continue. They don’t have to die either, just failing their main goal clears as well.",
    "userId":"647b712e0790ea734bcca1be",
    "groupId":"64847442404a2b77e9f913cd"
     },
     {
        "title": "Can someone suggest an anime with a 'bad' ending/where things just keep getting worse. Not an ongoing please.",
    "bodyText": "I doubt there is anything like that. Every depressed/loser mc just finds some girl and gets happy and I'm tired of seeing all this romance shit. I just want something bad. Or at least bittersweet. Anyone has any suggestions? Also, preferably something short.",
    "userId":"647b712e0790ea734bcca1be",
    "groupId":"64847442404a2b77e9f913cd"
     },
     {
        "title": "Anime that respects your intelligence and doesn't feel the need to voice every thought?",
    "bodyText": "I've been trying to get into Hell's Paradise and JJBA but the over-narration is a huge pet peeve of mine. I can still watch it (it didn't particularly bother me with Naruto for example) but it really hinders the experience. This is why extremely loyal adaptations of the manga bother me. Anime can capitalise on the fact that the viewer can discern more from what's happening on screen than you can on a manga panel. For example, you don't need fifty comments about someone hitting you with their elbow, because we can see that that's what's happening. If MC is telling a girl with scars that she shouldn't hide them, you don't need to flashback to him saying the exact same thing to his wife. Since we already know his wife has a scar, the viewer should be allowed to make that link on their own, we're not idiots for God's sake. (And just reading a panel takes far less time so it isn't a huge issue). i guess I'm just looking for something more subtle and refined. Anything that fits the description?",
    "userId":"647b712e0790ea734bcca1bd",
    "groupId":"64847442404a2b77e9f913cd"
     },
     {
        "title": "i want an anime with a ruthless mc",
    "bodyText": "I always hated the cushy morale hero mc (i'm too lazy to put an in-depth explaination here). I want an mc who simply doesn't care about morales or killing, i want a 'hardcore' anime (i'm cringing inside but i'm too dumb to find a different way to word it)",
    "userId":"647b712e0790ea734bcca1b6",
    "groupId":"64847442404a2b77e9f913cd"
     },
     {
        "title": "Have you ever grown tired of school anime?",
    "bodyText": "This is not a rant. Some of my favorite anime depicts school activities, I just want to have a talk. So, for quite a long time I loved watching school anime and found absolute gems, good shows, and mediocre shows. The laid back vibes combined with comedy in most of them were something that always drew me in. And I kept watching, always looking for something new in the genre. The thing is, I was progressively enjoying this type of anime less, and today I almost can't stand watching anything that mainly takes place in a school environment. I now despise some tropes that previously I was okay with. I don't want to know about clubs, the sports festival or the cultural festival anymore. Now I actively avoid school anime and sometimes it almost feels like there's nothing worth giving a chance. It's like I've already seen it all. I don't know if I maybe watched too much of it or maybe I never really liked all that stuff and just tolerated in the early stages. I want to know if any of you guys has ever experienced something similar.",
    "userId":"647b712e0790ea734bcca1b5",
    "groupId":"64847442404a2b77e9f913cd"
     },





     {
        "title": "What about what I want?",
    "bodyText": "If anyone ever says 'What if you meet man who wants kids?' This is the only answer. Look them straight on the eye and don't let go until they answer. Then tell them that they don't view you as a human being with wants/needs/aspirations. I am done... DONE with all this misogyny.",
    "userId":"647b712e0790ea734bcca1b5",
    "groupId":"64847442404a2b77e9f913ce"
     },
     {
        "title": "How do you deal with misogynistic women who want you to have husband+ kids and won't stop troubling you?",
    "bodyText": "Any hacks advice recommendations anything please? Misogynistic women are a pain in the neck. And it's not always possible to make distance. They hate absolutely everything about feminist women while simultaneously using the very comforts feminist women fought and died for. And if you don't follow their rubbish ideals then they gang up and hate on you. Making up lies that they believe and forward it to everyone till people who aren't a part of their group hears it and they're really good at convincing people. Sly taunts and shaming you for being single and child free. I know misery loves company and they do this because they're stuck dealing with a sleazeball deadbeat manchild and 4 kids + household chores and want the same for you but how do you tackle them? Everything you say gets a 'oh you know nothing about life you don't have a husband or a child' like wtf what do YOU know you've been sold a patriarchal lie and clearly live a miserable life with all the stress. At times I feel like I should come out as feminist and watch their brains get short circuited lmfao.",
    "userId":"647b712e0790ea734bcca1b6",
    "groupId":"64847442404a2b77e9f913ce"
     },
     {
        "title": "It's miserable how middle-aged breeders think, 'no kids = boring life'",
    "bodyText": "Do those breeders not understand that life is filled with SO MUCH, such as an appreciation for the arts (literature, music, film, etc.), conscious efforts to live mindfully (e.g. through ethical lifestyle choices that can bring one closer to one's desired lifestyle), the development and exploration of countless new hobbies and habits, and — best of all (and rather exclusive to us childfree individuals) — the time to do anything on your own terms? It seems all those middle-aged breeders try to act as if 'having more time just to live without being preoccupied/unnecessarily busy' is a bad thing... when that's EVERY financially stable (meaning basic survival is not at all at risk) human being's dream. HILARIOUS. They have been conditioned by society to unquestioningly breed such that, once they are given the chance to free themselves of such societal conditioning, they choose to SHY AWAY from freedom and even DETER other people from it. This 'crabs in a bucket' mentality just reinforces how those who are bondaged can be the ones most likely to reinforce and perpetuate their slavish mentality. I'm (19F) so thankful I found this community 'early' since I always knew I hated kids (I've had fantasies or 'mental jokes' of making them cry ever since I was in elementary school, and I was always very annoyed whenever I looked after kids as part of school assignments).",
    "userId":"647b712e0790ea734bcca1b9",
    "groupId":"64847442404a2b77e9f913ce"
     },
     {
        "title": "Politely telling friends you'll never babysit",
    "bodyText": "I had barely spoken to my friend in the past few years and we finally had a great phone conversation during which I politely feigned interest in her new baby. She called me the next day asking me to baby-sit over the weekend she could go to work and she'd pay me. I love her but the audacity surprised me. Why would anyone think I'd spend my rest time hanging out with your kid all day? I said no but she shouldn't have even asked when she knows how I feel about kids.",
    "userId":"647b712e0790ea734bcca1ba",
    "groupId":"64847442404a2b77e9f913ce"
     },
     {
        "title": "Doctors care more about fetuses than women",
    "bodyText": "When my partner went to the doctor to request a vasectomy they were reluctant to do it as we are in our 20s and don't have any kids. Doctor said why don't you stick to your wife using birth control, partner explained that I have tried all sorts of birth control options and have had side effects (even ended up in A&E because my body rejected my IUD). The doctor ROLLED HIS EYES when my partner was explaining the issues I've had. Doctor only agreed to do the vasectomy when my partner told him that we'd previously had an accidental pregnancy and abortion. Goes to show that the doctor cares more about an unborn fetus than the suffering of a woman. Just needed to rant. I'm so sick of the healthcare system at the moment.",
    "userId":"647b712e0790ea734bcca1bb",
    "groupId":"64847442404a2b77e9f913ce"
     },
     {
        "title": "Why can't people just accept I don't want kids?",
    "bodyText": "I was at my niece's christening this weekend, where I was very happy to be Godmother (we're in Ireland, where even if you're not devout Catholic christenings are the done thing). My 3 bio sisters (V, A & R) all have children and I love them dearly, but at 31, I don't have any. I have a dog and 3 cats and a partner of 9 years that I'm more than happy with. I've finally started to feel like I'm getting somewhere in life. After years out of work due to my mental health (BPD) I finally started working again last year and am going to start a new job this month in a field I'm really excited about with a great salary. But on Saturday, all people could ask me about was when they'd be having the 'next christening', i.e. my child, even my sister A made comment about me being broody when I was trying to put my niece to sleep (trying to a good godmother/auntie so my sister R could enjoy herself). I've been very open with my family that I don't want kids & that I'm more than happy being the cool aunt that my nieces and nephews can come to for anything. Like I said, I don't hate children, I love them very much in small doses but I don't want to be a parent full time. Not that it needs explaining but I get overwhelmed very easily and don't think it would be fair to bring a child into this world - particularly when I struggle to take care of myself most days. My family have fostered for more than 20 years so I know the damage that can be done to a child, even if they're fortunate enough to leave a bad situation early. Why can no one just accept that I don't want to be a mother? Why do people keep assuming it's okay to discuss my reproducing or not? I have thought about this for a long time, I'm not gonna 'change my mind' and even if I do, there are plenty of children who need homes already. Why can't I just be allowed to be the childless aunt without people assuming there's something wrong with me, that I'm selfish or I'm missing something in my life? I'm entitled to be happy, after years of trying to figure it out I know what will make me happy and kids aren't it. Sorry for the long post, but I don't have many people I can actually discuss this with.",
    "userId":"647b712e0790ea734bcca1bb",
    "groupId":"64847442404a2b77e9f913ce"
     },
     {
        "title": "A kid took my cane and somehow I’m the bad guy?",
    "bodyText": "This happened a few weeks ago and I just wanted to share here because this subreddit understands me. I’m 31F and childfree. I don’t hate kids if they belong to friends or family, I just don’t want to deal with random stranger’s kids and I absolutely can’t stand when their parents don’t do their damn jobs and control their kids in public. I have a joint disorder that causes my joints to break down over time (one of the many reasons I don’t want kids). I’ve torn completely through all connective tissue in my hips which means I sometime need to use a cane, especially if I’m doing a lot of walking. So onto the story. A few weeks ago I was at a warehouse sale for a closing bookstore. Thousands of books all for $1 each, you can imagine my excitement! But the warehouse was chaotic and the “aisles” were so full I was struggling walking through them with my cane and not tripping over piles of books, so I set my cane on my cart at the end of the row, since the carts were too big to push down the aisles. I came back up toward my cart and see a kid (maybe 4 years old?) playing with a cane that looked like mine. I look down at my cart and sure enough, my cane is gone! I very loudly say “Absolutely not!” and go take my cane back while I tell the kid “Not appropriate! You don’t take people’s things.” Suddenly the mom appears from around the corner with the rest of her litter of children and starts saying how “she’s just a kid” “she didn’t know” etc. and I just look at her and say “It’s your job to teach her, not mine.” Of course she just stared at me like I’m the asshole. EDIT: I just want to say a huge thank you! You all are so supportive, and I really appreciate that. It’s amazing what venting to people who actually understand can do! I’m incredibly grateful for this community!",
    "userId":"647b712e0790ea734bcca1bc",
    "groupId":"64847442404a2b77e9f913ce"
     },
     {
        "title": "I feel like the majority of people who want kids haven’t considered the reality of having them or done their research",
    "bodyText": "I have a friend who says she wants three kids. I’ve known her for over a decade, and she’s someone who gets flustered easily, is prone to breakdowns and easily overstimulated. She’s almost 30 now, and it frustrates me because I just don’t think she’s thought about it very much. I absolutely support my friends having kids if they want them, but have also pointed out that three kids is incredibly expensive. She and her partner don’t make much money. I genuinely believe that childfree people have made that decision because we’ve actually THOUGHT about stuff. I have another friend who loves travelling every year, really likes to have time to himself, has solo hobbies and broke up with a girl because he was sick of her dog (had to consider it all the time) and he wants kids! I know some people who genuinely show traits they’d make awesome parents, but I also know people that just don’t seem to have compatible lifestyles with having children. Oh you didn’t know childcare was so expensive? Why the fuck didn’t you know?",
    "userId":"647b712e0790ea734bcca1bc",
    "groupId":"64847442404a2b77e9f913ce"
     },
     {
        "title": "IM GETTING MY TUBES REMOVED!! 💃🤗🥳",
    "bodyText": "I have been thinking about this for a very long time. I know I don’t want kids. I am CONSTANTLY pressured by my mom and step mom. I am not sure if I will tell them I am doing this, but this is my choice. My partner & I have been together for 8 years, and we both do not want children, we talked about it extensively. He is super supportive and so is my sibling. I feel super grateful to live in a place where I have reign over my body. VT, you rock 🤘",
    "userId":"647b712e0790ea734bcca1bd",
    "groupId":"64847442404a2b77e9f913ce"
     },
     {
        "title": "I have my vasectomy on Friday! I can't wait!",
    "bodyText": "It's been about 6 months since I started the process and was just waiting for a date; I've posted a few times before as I've gone through the different stages. I called up the place that have been handling my case, on behalf of the NHS, and they said they had a spot this coming Friday and did I want it? Heck, yes! Can't wait to get this done!",
    "userId":"647b712e0790ea734bcca1b6",
    "groupId":"64847442404a2b77e9f913ce"
     },
     {
        "title": "What to do about a relative jealous of me for not having kids...",
    "bodyText": "This is a cousin-in-law of mine with young kids, got married young, had kids young, kids are a handful, has many regrets. You guys know the story. Pretty conservative family in a conservative area so thats kind of par for the course. Every other woman I know in the family had the exact same trajectory. Like she knows I'm childfree so has obviously considered me a safe person to talk to, but I have no other response to comfort you than 'ya it was pretty dumb of you to get peer pressured into kids you know you didn't want.' Its not even a change of mind situation. I get that because you know i dont want kids, you think i'll side with you somehow about how much you dont love your little brats and hit them when you get upset. But as a survivor of abuse. Yeah nah. I respect that she wants some kind of change here because she knows its a bad situation for everyone. But I got nothing for you. I can't say your children will have a better environment in foster care. You will be publically ostracised if you give up your kids. Your husband will probably leave you. Your body will never go back to how it used to be. Nothing I can do bout it? I can have empathy for someone who was pressured into these permanant life choices as a teenager but honestly i don't see an escape route for you. I guess you could divorce your husband and give him full custody but you have never been able to hold down a job and live off your partners money. Can't even say you do a majority of the raising because yeah the husband also does a great job with the kids while she sulks (he's kind of a jackass for pressuring her into having them sure, but he pulls the majority of the weight unlike most dads). What do you guys say to ppl like this? We all know how to handle the usual disapproval of our lifestyle but idk how to handle someone in hysterics over how jealous they are. Plus admitting you dont love your kids and hit them doesnt sit well with me...",
    "userId":"647b712e0790ea734bcca1be",
    "groupId":"64847442404a2b77e9f913ce"
     },
     {
        "title": "You WILL end up having a child and I can't wait to laugh at you the day I see you with a baby on your arms.",
    "bodyText": "It has been like a week since this happened but still, this btch of a client came back today and I thought of sharing his fcking audacity of daring to say this sh*t to me even thought he doesn't know me. It didn't matter that I said that I don't have an interest in being a mother, or having a family, I was bound to change my mind sometimes soon. (This is a part of the convo we had).  Me: I'm 30 already. If imma change my mind when tf is it going to happen?  Him: So what you think you're too old? What if your boyfriend wants to have kids?  Me: He can go to another woman. I don't care about his ass if that is the case.  Him: Wow you don't really sound like you love him.  Me: So what?  The funniest part is that he admitted once that he regrets having 3 children.",
    "userId":"647b712e0790ea734bcca1be",
    "groupId":"64847442404a2b77e9f913ce"
     },







     {
        "title": "why don’t car manufacturers make cars look like they used to back in the 60s to 80s?",
    "bodyText": "is it simply to cut costs and maximize profits? i feel like big name car companies could make a killing if for instance they released a new camaro that looked like the ‘69 camaro, or a new dart that looked like the ‘63 dart.",
    "userId":"647b712e0790ea734bcca1b8",
    "groupId":"64847442404a2b77e9f913cf"
     },
     {
        "title": "Scooters/Motorcycles getting pulled over in Doral?",
    "bodyText": "Just commuted to Doral up Perimeter road and all up to 82nd Ave it was just full of motorcycle cops who pulled over people on scooters and motorcycles. There was even a flat bed tow truck on 78th Ave with a bunch of scooters loaded up on the bed. Anyone know what’s going on?",
    "userId":"647b712e0790ea734bcca1b8",
    "groupId":"64847442404a2b77e9f913cf"
     },
     {
        "title": "Motorcycle/scooter users- you are not invincible",
    "bodyText": "Just today I had a motorcycle user with his lady friend on the back cut in front of me while going down Walterdale Hill. And I watch him proceed to weave in and out of cars going excessive speeds. For the love of God, please take a quick google search and see the results of motorcycle injuries. It just takes one mistake for you and your friend to be in the ER with irreparable injuries or even worse, dead. You are not in a movie, you’re not a stuntman, you’re not a cat with 9 lives.",
    "userId":"647b712e0790ea734bcca1b8",
    "groupId":"64847442404a2b77e9f913cf"
     },
     {
        "title": "Electric Scooters and Motorcycles",
    "bodyText": "The Police need to clamp down HARD on folks riding electric scooters and motorcycles without proper license plates. Slapping 'E-Bike' on the back of your highway capable bike seems to be the 'new thing.' Am I the only one noticing this?",
    "userId":"647b712e0790ea734bcca1b7",
    "groupId":"64847442404a2b77e9f913cf"
     },
     {
        "title": "Why don’t car companies make almost exact replicas of their older classic cars/trucks?",
    "bodyText": "It’s no secret that a large majority of people like the look of classic cars and trucks. So why don’t companies like ford just make the same car like a mustang from 71 or a f100 from 76 and just add safety features on the inside? They spend money redesigning and redesigning when I feel if they used the same body they would almost be guaranteed a lot of sales.",
    "userId":"647b712e0790ea734bcca1b7",
    "groupId":"64847442404a2b77e9f913cf"
     },
     {
        "title": "Would you judge me if you saw me scooting through the truck stop on a razor scooter?",
    "bodyText": "Ok so long story short I want a set of wheels to get me around/get some exercise this summer. I’ve tried many ways of mounting my bike to the truck which all end up being more trouble than they’re worth. I thought about skateboarding but then I remembered I don’t know how to do it. But then I got the golden idea of a razor scooter. Cheap, effective, easily storable, etc. Only problem is what would people think if they saw a grown ass man with a beard scooting around on a razor scooter.",
    "userId":"647b712e0790ea734bcca1b7",
    "groupId":"64847442404a2b77e9f913cf"
     },
     {
        "title": "Noise in from motorcycles and mopeds?",
    "bodyText": "I've lived in Paris for a few years, and the noise is increasingly getting to me. The problem is not cars or trucks or construction or even the explosions from les greves. It's motorcycles and mopeds. These little two-wheeled monsters scream through the streets ten times louder than anything else in the city. They're louder than police sirens! All cities have noise problems. But I've found that Paris is pretty bad in terms of how loud motorcycles and mopeds are compared to other noise sources. Are other people frustrated by this? Do you not get occasionally startled by a building-shaking rumble, only to see a tiny scooter zooming by?",
    "userId":"647b712e0790ea734bcca1b7",
    "groupId":"64847442404a2b77e9f913cf"
     },





     
     {
        "title": "ruined my life",
    "bodyText": "I've been lurking this sub since I found out I was pregnant. Long story short, IUD baby.. husband pressured to birth baby even when I sobbed for an abortion.. gave in to exterior pressure from family and friends that 'I would fall in love once it was here' FUCK NO. And fuck every person who blamed hormones for my feelings. Anyways I was 27, had already graduated college, lived abroad a few different times, fresh into my new logistics career and I loved my husband. I was always a generally happy person, bubbly and excited about living every morning. I lost everything after having a baby.. it started with my body, then my friends, then my autonomy, then my sleep, then my happiness and with that I lost my marriage, my sanity and my will to live. I never wanted to be a mom. I always thought babies were extremely boring, toddlers were dirty and annoying and I never experienced any type of baby fever. I wake up every morning hearing him cry and all I can do is grit my teeth, here we go again. Endless cycle of crying, feeding, bathing, changing until it's bedtime and I'm to drained to eat anything after eating half a banana the whole day. I used to spend my god damn days smoking weed and tanning my hot body on different costa rican beaches and now I'm a depressed overweight shell of my old self that cries everyday wishing she could crawl back to her old life. My advice to anybody on the fence or currently pregnant, just don't do it. Stay child less and enjoy your life please.",
    "userId":"647b712e0790ea734bcca1b5",
    "groupId":"64847442404a2b77e9f913d0"
     },
     {
        "title": "Getting really sick of everything…",
    "bodyText": "My (F23) son is now 7 months old, still not really finding myself fond of him despite his occasional 20 minute cute episodes. He then just goes right back to whining or crying about something. My husband (M22) and I just went on a trip for my birthday, I had fun for the most part but of course bringing our son partly ruined things. I expressed to my husband in the beginning when we had my son that I didn’t really want him. In exchange my husband told me that he’d be picking our son over me. I haven’t once forgotten that (although I understand where my husband is coming from at least). However, I also made it clear to my husband that if that’s the case, I’m not willing to go the extra mile. I do the bare minimum. I pay for daycare, feed and change the baby. Watch him if my husband is sleeping if necessary. But that’s it. Now all I get are huffs and puffs from my husband (again, I get why) but if he wanted this life so bad, he can keep it and not drag me into it. Every once in awhile he will throw in a backhanded comment, maybe wanting me to bite or blow up in response. One time he said “what is it that you actually do? Do you even do anything?” Meanwhile, I (1) have depression/anxiety (I bet you can guess what wonderful miracle of life caused that one) and (2) he’s the one who wanted to keep the baby in the first place. I’m trying to keep my cool, but his attitude is building up while I’m trying my best to keep everyone happy. Not to mention my husband is back to having a secret Twitter account where he looks at naked women all day (and some other things but who am I to out him, let’s just say I don’t think he’s fully straight, which is okay with me). It’s all building up, and I’m growing more tired of him and the baby by the day. I’m not in a situation where I could leave anytime soon. But I can’t talk to anyone else about these other things so idk.  Anyways, happy pride month to any of the parents on this sub that are part of the LGBTQ+ community, I’m bisexual myself. I should’ve married a damn woman instead of putting up with this bs.",
    "userId":"647b712e0790ea734bcca1b5",
    "groupId":"64847442404a2b77e9f913d0"
     },
     {
        "title": "Do kids really serve any utility or purpose in the modern world? Our minds literally have to make us stupid and irrational just to continue the existence of our species",
    "bodyText": "I don't mean to ask this to sound mean or to criticize parents (im a mom myself) but I've been having this thought for a long time now and I want to hear other people's opinions on this. Im really trying to find a concrete purpose or ways having a kid adds more benefit to a person's life in the modern world. You could make the argument that kids had purpose before industrial society, like if you lived on a farm it would be beneficial to have kids so you'd have more people around to help out. But most people, especially in 1st world countries don't live like this anymore. In today's world kids are more of a liability than a utility and idc if saying that makes me come off as a narcissist or psycho or whatever. Too many peoples lives (including my own) have basically been ruined as a direct result of having kids, I've witnessed everything from moms fearing for their life because they're forced to keep in contact with a known abusive ex for the sake of child custody and not being able to move out of their shitty hometowns to where they want for better career opportunities to decent men barely being able to see their kids and being forced to give their junkie ex 25% of their earnings for 'child support' that doesn't even support their child but their ex's drug habits. They can barely save money or improve their conditions because a good amount of their earnings are robbed from them every month despite being actively involved in their kids life. (I'm not entirely against child support and I think willing deadbeats should have to pay but not decent father's who see their kids as much as daddy government allows them to). Some will say that kids can take care of you as you get older which isn't always true. When you live in a culture of individualistic neoliberalism you can't count on anyone for anything and every other word you hear is 'nobody owes you shit' which to be fair, not everyone deserves to be helped in their old age. One person tried to tell me they can do chores but let's be real kids these days aren't doing chores and just sit on their ass playing Fortnite, watching hentai and having no friends (speaking to you, gen Z) It's crazy to think our bodies and minds had to create mechanisms to make us irrational and sensation seeking. If humans didn't have bouts of baby fever or a sex drive we wouldn't be here because logically we realize kids are a net negative, What about kids can be beneficial and fulfilling? I'd like to hear peoples thoughts on this",
    "userId":"647b712e0790ea734bcca1b6",
    "groupId":"64847442404a2b77e9f913d0"
     },
     {
        "title": "I watched Pearl and I felt for her",
    "bodyText": "Have you guys watched Pearl? It was all over tiktok a month ago. I swear, that movie hit so close to home, it almost felt like Pearl was me. Having big, inspiring dreams, but always failing, no matter how hard you try… Always failing. Never being able to escape the shit life of poverty, yet seeing others having it so much easier. Wishing you could be them… But instead you’re just cursed by poverty and failure. Just like Pearl. I also have a dream. A dream that has been destroyed the moment my son came into this world. Pregnancy and birth have ruined my body. Now I look like Caucasian Shrek. I used to look just like Pearl. I had a perfect body. Now, I am grieving my body every day. I don’t care if it sounds stupid, but I wanted to be a professional pole dancer. Yeah, many overweight women can still practice, no problem, but not me. Because I want my body that I used to have. I am not fatphobic, I just want myself back. I’m only 25, I always had this dream, and now… it’s all in vain because I have a child. I have severe diastasis recti, severe back pain, no control over my bladder and once I bend over even a little bit, I get acid reflux. I am over an year postpartul and I never “bounced back”. I never healed. Pearl wished to be a dancer and an actress. She was ready to sacrifice everything. But for her, it was never meant to be. What if that’s going to be me as well? I live in miserable poverty. Can’t even afford three meals a day. Thank god for my child’s daycare and their free lunch. I have been rejected from every single job I applied to. My husband is in debt. We’re close to being evicted too. I just don’t see myself out anymore. I think that I too should accept that I was never made to be happy or decently wealthy. I was made to always suffer, always regret, always fail, always be poor. However, I am having a really hard time accepting it.  I should have just aborted and call it a day.",
    "userId":"647b712e0790ea734bcca1b9",
    "groupId":"64847442404a2b77e9f913d0"
     },
     {
        "title": "Having a kid makes me feel less intelligent",
    "bodyText": "Am I the only one who feels this way? I never considered myself a know-it-all, but I never thought of myself as dumb or irrational until I had a baby. Now I feel like my IQ is room temperature in damn Celsius. The laspe in judgement that led me to have a kid took such a blow to my self-esteem, I no longer trust myself with making my own decisions, especially if those decisions are pretty life altering (ie: choosing where to live, who to live with, employment, education, spending money). I don't think being around women who are abuse survivors but openly claim how thankful they are they didn't let a 'low value male ruin their lives and have kids with them' and go on to call women who have kids with these men stupid, dumb, damaged and unintelligent helps make my situation any better. I hate God for not making me infertile. The all-knowing being should've known motherhood wasn't for me or whatever. At least if I had an abortion I'd be able to fit in with most of my friends/people around my age. Idek anymore man",
    "userId":"647b712e0790ea734bcca1ba",
    "groupId":"64847442404a2b77e9f913d0"
     },
     {
        "title": "I feel like I’m trapped.",
    "bodyText": "I hate my life. I mean seriously, I can’t stand my life. Im a first time mom to a 3 1/2 week old baby. I hated my entire pregnancy due to the father (my husband) not claiming the child then dragging me through this endless roller coaster of saying it was his kid and then it wasn’t. By the time it was too late to get an abortion, he started acting even worse towards me when I threaten to leave and put him on child support when the child was born. Then he went off and joined the military and claimed the child then. I was in labor for over 50 hours and when the child was born he wasn’t there due to graduating Basic Training. He admitted he didn’t believe the child was his still until I sent him pictures of the baby (who he absolutely cannot deny as the child looks EXACTLY like him). I feel so betrayed and wish I had just gotten an abortion. I am now about to start the process of divorce and desperately want my old life back. My body feels fat and disgusting, my depression is so bad I just want to sleep and never wake up. Everyday feels like a never ending nightmare and soon he’ll be leaving for deployment for a year, leaving me stuck with this child. I hate myself for putting myself in this situation, and am highly considering adoption for the baby.",
    "userId":"647b712e0790ea734bcca1ba",
    "groupId":"64847442404a2b77e9f913d0"
     },
     {
        "title": "Being a parent in today’s modern society is miserable.",
    "bodyText": "Life was a lot of hard work as an adult BEFORE kids came along. There was already a lot of drudgery keeping up with a full time job and life in general. But add in a kid and its been pure chaos. The drudgery of life has multiplied 3x. I have a needy child always demanding my time, attention, patience and so much more. It never ends. You end up losing the majority of the free time you once had. You’re constantly tending to their issues from the moment they wake up to the moment they fall asleep. You can no longer be spontaneous in life, you always have a kid attached to your hip and you have to always be cognizant of what you do because you need to plan and coordinate your life around their needs and schedule. As much as you can plan though, they are so fickle and unpredictable. One day they are in a bad mood just because, the next day they are sick because they picked up the latest virus at daycare, so much sickness that long ago I lost count of how many times we have all been sick. When you inevitably get sick from their germs you don’t get to just sit in bed and rest. You still need to parent and take care of your kid. Bonus points: They become moody and harder to take care of since they aren’t feeling well. Oh, also they sleep worse. It’s a sick triple whammy. (Let me further elaborate on sleep later because that’s a whole issue on its own) Getting them to do what you need them to do is a exercise in frustration. The amount of cajoling required to get a toddler to do basic tasks makes you wanna scream; especially after they refused to brush their teeth for the 5th time. Then, half the time when something isn’t to their liking the end up throwing a massive tantrum because they can’t control their emotions. You can only discipline to a small extent because they are still too young to truly understand. Sometimes they get mad enough that they throw things and slap you out of frustration. You get yelled at and slapped but you still need to maintain calm and composure. They don’t know any better so they make a mess of your home. They leave their toys all over the place (under the sofa, all over the floor) They go through clothes like no tomorrow so now you also have much more laundry to do, and a messy house to clean. You try to keep up but eventually you succumb to the mess, its just too much to try to keep it clean. But let me go back to the topic of sleep because boy oh boy I gotta tell you, for those of us with the kids that have/had sleep issues we know acutely how much it messes with you. Some kids struggle with sleep. That was toddler for the first year and a half of his life. He woke up many times a night. The sleep deprivation was traumatizing. When you get disrupted sleep for months on end you start going crazy. You can’t even function properly during the day. I had a screamer so he’d wake up screaming in the middle of the night. Night after night, week after week for so so long. In the midst of this, you still need to do everything a adult needs to do on the daily. In our modern society, we’re all busy enough as it is. And people wonder why many opt not to have children anymore…  Just wanted to rant a bit..",
    "userId":"647b712e0790ea734bcca1ba",
    "groupId":"64847442404a2b77e9f913d0"
     },
     {
        "title": "The Burden of Parenthood, Regret, and Confronting Internalized Misogyny: Loss of Autonomy and Self-Identity",
    "bodyText": "Recently, I've found myself consumed by a pressing question: How do cultural norms and internalized misogyny shape my experiences as a parent? This introspection is rooted in a stark disparity I've observed - the differing expectations and contributions between cis-gender heterosexual men and women in parenting. While grappling with this issue, I turned to feminist literature for insights. Engaging with works like Andrea Dworkin's 'Intercourse' and Catharine A. MacKinnon's 'Toward a Feminist Theory of the State,' my eyes were opened to the pervasive subjugation of women, pushing me into a state of grief. Yet, as I delved deeper, I realized this isn't just about mothers. Fathers too are boxed into roles - the breadwinners, the emotionally distant - alienating them from the domestic aspects of parenting. These societal constructs contribute to the imbalance in partnerships, even progressive ones like mine. The truth is, I've carried an overwhelming burden, managing everything from household chores to after-school activities. Despite my partner's willingness to help, I am the one expected to delegate, plan, and organize. This tiresome expectation persists despite the evident inequality it creates in our relationship. Amidst this, I've also felt the harsh sting of undervaluation. My significant contributions often go unrecognized, overlooked in the face of trivial accomplishments from my partner. This disparity is a chilling reminder of the low standards set for men in the context of family life. What once was my sanctuary, my home, has turned into a space of anxiety, filled with the anticipation of guilt associated with rejecting sexual advances. This discomfort intensifies knowing my partner equates physical intimacy with expressions of love. Adding to this complexity is the loss of my individuality, replaced by guilt and shame at the thought of spending time away from my family. It's disconcerting to realize how much of my identity has been swallowed by this collective persona of 'parenthood.' Through sharing my experiences, I hope to connect with others facing similar struggles. I seek advice on dealing with the immense burdens of parenthood, the painful realities of internalized misogyny, the longing for an equitable partnership, and the loss of self. How does one navigate this labyrinth of complex emotions and experiences?",
    "userId":"647b712e0790ea734bcca1bb",
    "groupId":"64847442404a2b77e9f913d0"
     },
     {
        "title": "recently seperated",
    "bodyText": "so my ex wanted kids and i didn’t until at least i managed to get through college or get a good career on track, but he said condoms were uncomfortable and apparently the bc pill isn’t enough to stop a dumbass that refused to pull out so here i am a mom at 21 to an extremely sweet baby and now since a bunch of crazy shit went down with my ex and his family (posted somewhere else i can copy and comment for context) now i’m living with my family in another state as a single mom to a baby i didn’t even want. i’ve lost everything, my health, money, career, and sense of security and now i’m just sitting back questioning everything. i wish people came with warning labels so i wouldn’t have believed any of his lies and never even let it go past the first text. he’s also now trying to fight for custody (or threatening since no action has been taken) for a kid he never once helped with and openly said he didn’t care about dealing with him since it was my job. i just feel like a total idiot all around and a failure as a person and especially as a mom because of the way i feel. my kid will never know i feel like this and nothing is his fault obviously i just can’t stand my life at this point . i had goals and needed to get a lot of medical stuff sorted thats now 10x worse since having him and having a terrible birth. i just don’t know where to go from here or how to be positive.",
    "userId":"647b712e0790ea734bcca1bc",
    "groupId":"64847442404a2b77e9f913d0"
     },
     {
        "title": "Feel Awful",
    "bodyText": "Parent of a 10 week old baby and I'm feeling awful about regretting agreeing to become a parent. Don't get me wrong, I love my child to death and would literally do anything for them, but I'm absolutely miserable. By all means they're an easy baby; don't fuss too much, sleeps regularly at least 6 hours a night and is pretty low maintenance. The only downside is they absolutely refuse to take naps in their bassinet during the day; it HAS to be a contact nap, meaning my spouse or I have to hold her all day. It's just so hard and emotionally/mentally exhausting. This is pretty much every day: I get up in the morning, change their diaper, we feed them, I get breakfast and coffee made for my partner and I,, feed the pets, all while my spouse handles the baby. I then go to work for 8-9 hours (remote), then swap out with my partner, who makes dinner for us. After dinner, I do the dishes, feed the pets their dinner, throw in laundry/fold laundry and then prep for bath time. After the bath, we put their pajamas on, read them a few books while they feed and get them settled for bed. While one of us rocks them to sleep, the other showers and brushes their teeth before swapping out with the other. After all this is said and done we go to bed and start it all over the next day. It's just so frustrating. Even when there's 'me time' for either of us, it's not ever truly 'me time'. There's always something that comes up, one of us can't get her to stop fussing or a diaper needs to be changed or we have to do errands. There's no 'off switch' to being a parent; you're ALWAYS ON. I know, it comes with the territory, but that doesn't make it suck any less. There's no time for the gym, no real time to focus on house projects/yard work, it's just wake up and go until you get a reprieve when you sleep. There are nights where I'll just say fuck it, once they're asleep I'll stay up and play a video game for an hour. Even if it means I'm losing an hour of sleep, it's much better than not having a mental break. I'm not looking for answers or solutions, I just needed to vent. I posted here once before and I got bombarded with people who made me feel like absolute shit for regretting this life I've chosen, despite making it clear my child is my #1 priority. I really wish the admins would clean up the subreddit more, I'll probably just bounce out of here if I get similar hate.",
    "userId":"647b712e0790ea734bcca1bd",
    "groupId":"64847442404a2b77e9f913d0"
     },
     {
        "title": "Does this ever get better?",
    "bodyText": "Will I ever even end up liking parenting? I’m so exhausted. My son is 10 months old and I still hate this. Did any of you feel like it got better? This just so so bad. I literally couldn’t stop crying earlier because I just miss my old life so much… 💔 Today I just want to go to sleep and never wake up.",
    "userId":"647b712e0790ea734bcca1be",
    "groupId":"64847442404a2b77e9f913d0"
     },
     {
        "title": "This isn’t fun.",
    "bodyText": "I hate myself for not enjoying my life and my children. I don’t think it’s depression. I simply am a bad mother and do not enjoy time with young children. I didn’t want to be at a kid’s soccer match this morning, make the kids lunch, plan the afternoon out, etc. It’s a countdown until the sitter arrives and I can go out to enjoy my life. I feel evil and like there’s something wrong with me.",
    "userId":"647b712e0790ea734bcca1b8",
    "groupId":"64847442404a2b77e9f913d0"
     },
     {
        "title": "I regret becoming a parent.",
    "bodyText": "I've finally admitted it to myself that I regret becoming a father to my two year old little girl. I don't know what possessed me to have a kid when I knew for years that I want nothing to do with raising children. I just feel like I should love my kid and want to be a father like everyone else. I don't understand being a parent. I don't understand them. They're beyond confusing as shit with having to teach them societal things that I myself don't even begin to understand. I'm considering leaving for an undetermined amount of time. The only thing that I understand how to do is set her up when she is older so she doesn't have to struggle as much financially. I'm severely on the fence about having more kids (mostly that annoying urge to procreate) but I don't want to put myself through the same experience again with my first one.",
    "userId":"647b712e0790ea734bcca1b7",
    "groupId":"64847442404a2b77e9f913d0"
     },






     
     {
        "title": "When reading, do you notice 'good writing' (as in beautiful prose)",
    "bodyText": "I'm in the middle of an online writing workshop, and the author/teacher said something I find confusing. She said that when she reads, she doesn't notice 'good writing,' she instead experiences good writing as a direct line of communication between an author, and her as reader.  I still have certain sections of writing by certain authors resonate in me; I can still remember certain descriptions of action, or setting, or dialogue, as particularly beautiful. And, I absolutely noticed it the moment after I read it on the page. I get at least a part of what this person is saying. But is it really that unusual for a reader to notice and appreciate prose that sings? If it is, how do we judge our own work? If we're writing the best we can, and strive to be better each time we sit in front of the keyboard-- will anyone notice? Perhaps this is an existential question (tree / forest), lol.  Thoughts?  Edited to Add: First off, thank you for all of the comments below, for taking the time to put forth your opinions and describe your reading experiences. Whether I disagreed, or agreed, all of them helped me find what I believe in, in the murkiness that happens to pass for my post-concussive brain right now. For the record, I don't find that resonant prose, or beautiful prose, or even poetic prose takes something away from my experience of reading. I find that it enhances the story when it's done well. I agree that it's an art form -- and those two comments about same, below, shifted my thinking in that regard. Of course, it can be badly done. Everything can. Of course a writer can try way too hard to make their prose 'beautiful' to them. Of course, the storytelling is as important as the prose. But, for me, I give those two separate things equal weight. Everything I read doesn't have to have sentences that take my breath away. But, sometimes they do. (Chitra Divakaruni's Sister of My Heart certainly does. Also Barbara Kingsolver. And, and....)  I'm not going to stress about this going forward. I'll write as I write, edit as I edit, and pick up my novel again and do my best. And, for the record, no matter my user name, I'm returning to an historical novel of suspense.  Thank you again, so much, for the help. Best of Luck to everyone with your projects.",
    "userId":"647b712e0790ea734bcca1b7",
    "groupId":"64847442404a2b77e9f913d1"
     },
     {
        "title": "Genre Writing vs. Literature",
    "bodyText": "Hey everyone, sort of new here.  Wanna start off by saying I was a literature minor throughout college but have transitioned into being an editor for several literary magazines. I write a lot, but don't put anything out, as it's mostly for refinement right now. I was trying to find a literary community on reddit. I think this subreddit is great, as anybody who reads is genuinely better off than anyone who doesn't (this is super controversial, but I'm maybe in the right place. Reading is magical to me, and easily the reason that I'm alive. I'm not gatekeeping reading, or judging those who don't, but it's simply the best thing in my life besides music). What I've found is that the people here don't read the sort of things I see are common in literary circles. All of us in any group I've been in can list off short story writers we like, and most of us can list off specific short stories we care for. I understand that short stories are more of a craft thing, but even when we talk about our favorite books, they either tend to be part of the literary canon, or something extremely contemporary (which everyone immediately fixates on and writes down on hearing, for later reading). I'm wondering, why is this gap so present in r/Books? 99% of the posts are about Y.A. literature, which I think is totally okay and good to read (hell, I LOVED twilight and hunger games), but I'm looking for more likeminded people when it comes to 'reading that takes serious work, and isn't always enjoyable'. I read old Russian literature (Brothers K, Anna K, Crime and P, Life and Death of Ivan Ilyich). My favorite book is Moby Dick. I read a lot of David Foster Wallace (everything he's every written, a lot of it multiple times), Cormac McCarthy, Denis Johnson, Don DeLillo, and George Saunders. These are what I consider vital to the contemporary writers' breadth. Where are the people who read this kind of shit? Is there a specific subreddit? Are we a dying breed? When I meet someone in real life who reads any of these authors, it's like finding a unicorn. I want to be able to replicate that experience online, so I can talk with someone who actually understands the insane writing that has been put out in the last couple centuries, and our conversations just flow smoother, almost easily.  P.S. This reads like a super pretentious shitpost, but I guarantee I am 100% serious. And I don't judge anyone who loves The Hunger Games by Suzanne Collins.",
    "userId":"647b712e0790ea734bcca1b8",
    "groupId":"64847442404a2b77e9f913d1"
     },
     {
        "title": "What got you into reading/writing fanfiction?",
    "bodyText": "I'm curious to see how others got into this rabbit hole. For me, I got into fanfiction in 2013 after I binged through the original Cartoon Network Teen Titans show. It ended off on a pretty dramatic cliffhanger and I was pretty sad to see these characters go, and also not see how several ongoing character arcs would have ended. I happened to see a summary and a link to a pretty interesting one shot fic of Teen Titans on a TV Tropes page. I read through it and was just so amazed at the idea of people being able to use an existing media franchise, and create their own ideas with the established world (Like an alternate universe fic, or even a continuation past the canon!). Flash forward to 10 years later, and I've never lost interest in this hobby. Although I'm not into TT as much as I was as a kid, I still appreciate the memories it's given me.",
    "userId":"647b712e0790ea734bcca1be",
    "groupId":"64847442404a2b77e9f913d1"
     },
     {
        "title": "Maybe it's just me but I feel the books I'm reading have affected my writing...",
    "bodyText": "I haven't really picked up a fiction book -- let alone finished one in a few years. I don't read as avidly as I did because work and life. But I've been reading non-fiction these past few years, because it doesn't require commitment as much as a fiction book would and can go back and resume anytime I want. Whereas a fiction book would require me to remember tidbits of info I'd forgotten after a couple weeks or month. I feel reading so much non-fiction has affected my writing now, it reads stiff and a little technical. I've been trying to work on a new WIP of short stories and I'm just not happy with my writing anymore. I guess this is more a reflection.. but wanted to also know if anyone has experienced the same, what did you do to fix it? Or maybe it's just me lol..",
    "userId":"647b712e0790ea734bcca1bd",
    "groupId":"64847442404a2b77e9f913d1"
     },
     {
        "title": "Reading-mode vs Writing-mode",
    "bodyText": "Idk if anyone has these kind of modes I do where I spend an undetermined amount of time focusing on writing. Like I still read fics but I'm more in a writing-mode. Pushing out 100k++ words in weeks, really on a roll. And then comes a time where I just... don't feel like writing much so I accumulate hundreds of tabs of fics open and I spend weeks or months just reaaadiiiing every fic I fancy under the Sun on ao3. It's something I realised that has been going on over the years, especially when I'm in this limbo of waiting for a new hyperfixation to come along for me to word vomit about. Does anyone else (authors especially) experience this weird switch between phases? And if so, how long did the reading-phases last? My longest was almost 3 years lol",
    "userId":"647b712e0790ea734bcca1bc",
    "groupId":"64847442404a2b77e9f913d1"
     },







     {
        "title": "I have lied to my friends so so much for so long and I dont know what's wrong with me",
    "bodyText": "This got triggered by me seeing a TikTok describing how they researched symptoms of trauma and replicated them to other people to act like they have that trauma and make up these wild scenarios that are absoloutely batshit insane for no reason and it kind of held up a mirror to me and I realised how batshit insane I am. I have lied to my friends about my past, my history, my parents talking about insane things that have happened to me, talking about how I have severe mental illnesses that I don't have, just lying for no reason. I lied that my friend died, a friend that doesn't even exist, I made them up, I lie about people being my friend in real life no they aren't I'm an antisocial recluse with no friends. I've done so much to make them think I have friends, that I'm smarter than I am, that I have more personality than I do that I'm more than what I am and I dont even know why because I know them and I love them and I know they would be perfectly fine with me without these stupid embellishments and now at first I may have done them to just 'make myself look better' but now I dont even know why the fuck I'm doing it by this point. I seriously don't I have no idea. Its not even just my friends I've been lying to its my family my own sibling why the hell did I feel the need to drag my sibling into this I dont know?? theres seriously something wrong with me and i know I don't have the strength of character to ever come clean to ever tell them all these lies to ever reveal the truth so all I'm doing is revealing it to reddit r/confessions because I will never be able to confront anyone I know ever about this. Oh my god I just seriously dont know what's wrong with me",
    "userId":"647b712e0790ea734bcca1bc",
    "groupId":"64847442404a2b77e9f913d2"
     },
     {
        "title": "I told everyone I know I got fired from a job that I quit",
    "bodyText": "For anonymity, I won’t be using the company’s name, but I will say this happened when I was 19. Now, I had just gotten a new job. I really only took it for the title, because it was a leadership position, and I wanted that on my resume to help me out with college stuff, internships, etc. Also, the company I was leaving had SO many management issues. People were getting fired left and right, unqualified people were being hired, and it was just too much. Most of the staff like me that had been around for a while quit because it was too much, and we were constantly being asked to do things above our pay grade. Also, we didn’t get breaks and there were no opportunities for raises unless you wanted to be a manager. So with that context, almost ANY job would have been better, right? Nope… you see, this new job had an incompetent manager as well. Which, whatever, that’ll happen a lot. But I and the other person hired at the same time as me we’re NOT getting trained. They just threw us in and said “do it.” Mind you, this was not the type of job where you just figure it out by participating. We needed to know the company procedures for safety and ESPECIALLY because we were in leadership positions. How else would we train people in the future? We tried to give it time, but after a week, we had learned nothing. The manager kept not showing up to work and just dumping us on other employees that didn’t know how to train. I had enough. There’s more to the story that drove me to quit, but it’s not super important, and this post would be far too long if I explained that. I would never quit a job without a backup plan. I knew there were a few things I could do to make money while I searched, and if all else failed, I was welcome at my old job anytime. So I quit. I’ve always been respectful about quitting, providing at least 2 weeks and such, but I couldn’t take it this time. I just left. My reasoning for telling people I got fired? I honestly don’t know. It seems silly now, but I thought all I’d hear was how it’s important to give it time, you’ll always have bad managers, etc. And if I wasn’t living at home and had rent to pay, I wouldn’t have quit until I had another job. I had other bills to pay, but again, I already had a plan. Overall, there was no reason to lie other than I was just embarrassed, which I guess is why I wrote about it here. Thanks for reading if you got this far.",
    "userId":"647b712e0790ea734bcca1bd",
    "groupId":"64847442404a2b77e9f913d2"
     },
     {
        "title": "I lied to my dad and blamed my younger sister, because of my period",
    "bodyText": "My parents are divorced so once in a week I go over to my dads house, this time I had my period. My first mistake was bringing ultra thin pads instead of those thick ones, the reason I didn't bring the thick ones was since my period this time was pretty light it was my second or third day, but oh boy was I wrong. Fast forward I'm sitting on the bed while my dad is in the same room sleeping, my sister is about to lay down next to me and suprise she finds a puddle of blood just right next to me. I was in horror I even called my mom for her advice. At the end I decided to just tell my dad that my younger sister messed up the bed (which isn't entirely a lie since she did mess up a part with that little makeup kit with barbie dolls), what I did was get that tiny lipstick and just smudge it all over the bed. He believed me and so I changed the bed and the reason I lied was out of pure embarrassement and not because he'd yell at me my dad is a good guy and would understand but I was honestly just horrified of his reaction. Should have I told the truth or am I right for lying?  EDIT: The way I worded the sentence in the end was pretty dumb, no one is ever right for lying so apologies for that, anyways read the replies for further details",
    "userId":"647b712e0790ea734bcca1be",
    "groupId":"64847442404a2b77e9f913d2"
     },
     {
        "title": "I blamed someone else for my car damage and he paid to fix it",
    "bodyText": "This is 7 or 8 years back. One night me along with my mates got bit drunk, it was actually bad, I wasn’t in good shape but still thought of driving back home. As I started and moved out of parking the driver side mirror smashed with another car. Not sure how much the other car was damaged but I left. I was drunk and not in 100% sense and honestly didn’t even realise what has happened. Anyhow next day realised that my driver side mirror is damaged and needs to be replaced. I looked around and the parts were expensive so slowly the idea fizzled out. Anyhow cut to 7-8 months after this, one day I parked my car and went to grab a coffee and this guy reverse parks beside me and while reversing scratches the same area and by time I am back to my car with my coffee . So I just started to claim that the mirror was perfect before and that while reversing he must have damaged my car. He then finally agrees to pay instead of going through insurance or maybe he didn’t had insurance. I felt bad but ended up taking the money.",
    "userId":"647b712e0790ea734bcca1b8",
    "groupId":"64847442404a2b77e9f913d2"
     },
     {
        "title": "I book patient clinic rooms in my work to sleep in.",
    "bodyText": "For context I work for the NHS (UK) and find some days so overwhelming with office work and paperwork that I will book any patient clinic rooms in our building that day for an hour to an hour and a half. I will then take in some work folders to look like I'm doing work and proceed to lock the door and sleep on the beds. Of course I clean down the beds after, but I am just so so tired I don't find the time elsewhere to sleep properly. Obviously napping means I don't finish some work and it carrys on to the next day and becomes a cycle but I get so tired I feel like I'll pass out and it's my only way to cope.",
    "userId":"647b712e0790ea734bcca1b7",
    "groupId":"64847442404a2b77e9f913d2"
     },
     {
        "title": "I just hit a trucks hitch on the highway and ran..",
    "bodyText": "This happened like 20 minutes ago. I was stupid and thought it would be fun to swerve for a bit. I ended up rearending older pickup truck in the hitch. It was fairly low speed and it only damaged MY car. As soon as I heard the crunch I took off. I’m only 16 and it’s my first accident. I’m sorry to the black pickup driver. I definitely learned my lesson about reckless driving. I don’t know if I will get in trouble with the law or not.",
    "userId":"647b712e0790ea734bcca1b7",
    "groupId":"64847442404a2b77e9f913d2"
     },
     {
        "title": "i stole an entire collection of the harry potter series from my primary school library",
    "bodyText": "i had already borrowed the total number of books i could and i had been waiting for WEEKS to read the order of the phoenix soo i kinda just snuck it into my bag when the librarian was doing something else. Then i felt super guilty so i decided to return it the next day but when i went back to the library the entire collection of harry potter books was just there so i kinda snuck all of them home. I was so fking desperate i even snuck one home in my PANTS. And then suddenly the library went under renovation for a few months so i had to hold on the the books for safekeeping of course, and i have been safekeeping them for the last five years now! I really want to just go and return the books back but im scared and nervous because i won’t know what to say",
    "userId":"647b712e0790ea734bcca1b5",
    "groupId":"64847442404a2b77e9f913d2"
     },
     {
        "title": "I lied to a coworker about my age to avoid him talking down to me due to age",
    "bodyText": "Birthday coming up and I lied to one of my coworkers about my age. After a few different times he would ask I would just agree with whatever number he said to rush through the conversation. This guy loves to remind people how young they are and I hate it. Monday is my birthday and I feel so guilty of this. I want to clear the air but I don’t want him to think my liar. I don’t like coworkers getting too deep in my personal life in general.",
    "userId":"647b712e0790ea734bcca1b6",
    "groupId":"64847442404a2b77e9f913d2"
     },
     {
        "title": "I sent my friend to the hospital by giving him WAY too much caffeine",
    "bodyText": "When I was 17, I threw a party. We decided to take shots of garbage concoctions from the fridge. Every last one getting nastier, I decided to make it a lot worse. I knew he would survive, I googled how much caffeine would kill a man, I asked him if he was sure that he wanted to take this shot. It had 2000mg of caffeine and foam on the top of it. He took it, I told him to drink a LOT of water. He didn’t drink that much. He was looking fine for the first several minutes, but then he sat down and started looking off to the distance with an intense stare on his face. He got a ride to the hospital. I asked if he wanted a ride but he insisted that his sister can drive him. I apologized right after and asked how it went. He said he was fine, he got an IV. I remember him telling me that the nurse asked him if your friend tried to kill you. Extra I am 21 now. Last week. I have been scoping out my lurking feelings of regret with the help of the voices, and took nearly the same dose I gave him, roughly 10mg/lb of bodyweight. I saw a visual of my friend pointing out exactly how much caffeine to take. I took 1800mg of caffeine, the first 3 hours went by nervously, I thought I was going to die a couple of times, laughed a couple of times about how easy it was. But at the 3 hour mark, I started to hallucinate a very vivid and surreal reality, looked like heaven (thank god). I got an impending sense of death. My heart felt like it was pumping steaming hot slush. Water was not enough. I took some ibuprofen. I felt okay afterwards. My heart was weakened for the next couple of days. I felt horrible for what I had done to him with a new perspective. I feel like shit still.",
    "userId":"647b712e0790ea734bcca1b6",
    "groupId":"64847442404a2b77e9f913d2"
     },
     {
        "title": "I never threw away that box of cigarettes I found in my closet",
    "bodyText": "F 16, chronic nicotine addict for literally anything. I’m said to be clean and have told ones I love I am, but when that box fell from no where in my closet, I couldn’t hold myself back. I told people I threw it away, when I didn’t. They trust me to be clean and I failed. I smoked each and every one to the filter when I said I hadn’t. They trusted I won’t but I did, and too keep a smile on there face I say I didn’t, this was a month ago. Lying is the wrong thing to do. Not the worst thing in the world but I am not proud, I have more stories to tell here, but that’s all for later.",
    "userId":"647b712e0790ea734bcca1b9",
    "groupId":"64847442404a2b77e9f913d2"
     },
     {
        "title": "I used to emotionally abuse people and then laugh about it.",
    "bodyText": "I was very young at the time, but I would intentionally verbally and emotionally abuse the people around me. It started with me telling my mom I hated her just because I got a thrill when she said that I hurt her by saying that. I would say it over and over until I would see her get really upset and then pretend to be sorry and apologize. I don’t know how many times over the few years I acted like this, but it was enough that even years later I remember doing it. I was worse to my first real friend. I would dangle our friendship over her head and tell her awful things about how I was the only person that liked her and that if she didn’t do what I told her, I wouldn’t be her friend anymore. I would talk about how much I hated her and force her to do everything my way. I did all of this at 4-5 years old. No, I’m not joking, I was that young and that cruel. I legit got a little jolt every time I made them upset. I thrived off of emotionally abusing them and then would giggle as they expressed how distraught the were at my words. My friend (rightfully!!) refused to hang out with me once we started kindergarten. I only had one friend because of how awful I was and I started gaining weight and, as shown by my own behavior, children can be cruel. I started to get bullied and it never really stopped until my junior year of high school. I made other friends throughout the years and while I was never that cruel again, I was thoughtless in my actions at times. I never did anything like I did as a small kid, however. I’ve thought of reaching out to my ex-friend before, try to apologize, but we’re in our mid-twenties now and she seems to be living her life to the fullest. Our friendship was ultimately short and she benefitted from no longer allowing me in her life. Doesn’t mean I don’t think about what would have happened if I was never bullied. I’m scared to this day I would have been a real monster.  Edit; after some thought, I sent a message via Facebook. I let her know that I was sorry for how I treated her in the past, that I don’t expect her to forgive me, but that she deserved an apology after what I did to her. I don’t know if she will respond, but since I can only apologize to one of them, I felt it was good for closure.  Edit 2; wanted to add context: we’re friends on Facebook and Instagram, we went to school together for 14 years, and have interacted since she stopped being my friend. We were amicable throughout school and have worked on school projects together before. My whole thing is that I just never apologized. We moved on like what I did never happened/mattered.  Hope that clears up some things. Lol",
    "userId":"647b712e0790ea734bcca1b9",
    "groupId":"64847442404a2b77e9f913d2"
     },









     {
        "title": "Gaming VS Programming",
    "bodyText": "I like programming but I love gaming. How did you get out of something similar ? I could program 1-2 hours and learn stuff feeling tired and sleepy but I could game for 8 hrs and feel the urge to play another game! I know gaming is mostly a waste of time but everytime I uninstall the game I tend to install it again and get back to the routine! Is there any escape from this ?  Edit. Thanks to everyone for the comments and motivation. I just uninstalled the game, will keep you updated on how long it will last and the results  Edit.Reddit keeps recommending gaming groups and youtube keeps recommending gaming videos but I am still holding strong",
    "userId":"647b712e0790ea734bcca1b6",
    "groupId":"64847442404a2b77e9f913d3"
     },
     {
        "title": "I'm 31 and just quit my job to focus completely on learning programming. Am I an idiot?",
    "bodyText": "I had a well-earning job and was making my way up the career ladder in an industry that didn't fulfil me and was just super stressful. I've been wanting to learn programming, but I was very tired and stressed from work all the time and never had the energy to do courses. At work, we sometimes needed to use Excel and SQL, and that was my favourite part of the job. I ended up going way above what is needed to carry out my duties and becoming advanced in both. I have built sheets and queries that allowed us to significantly shorten the time spent on the most complex tasks. I enjoyed writing long, complex formulas and queries and people would be surprised I didn't specialise in computer science at school. I'm learning python now and really enjoying it. I'm super excited. Sometimes though I have this feeling of dread because I fear that AI will replace programming in the near future. Other times I'm not scared programmers will be replaced completely soon, but that I'm too new and only very experienced programmers will be safe from AI very soon, and I'm not experienced at all. I have a nice place that I rent out and I'm still making decent money while I do online python courses. It's less the money that I'm worried about and more worried about the time I spend learning a skill that I might end up not using. What do you think about learning to code while we're entering the age of AI? Am I making a mistake? Should I beg my employer to take me back? My current job (I'm still serving my notice) would not be replaced by AI anytime soon.  Edit: Surprised to see that the post attracted so much attention. I really appreciate many of the comments, even some which are quite critical. There's a lot of useless noise in the comments section as well however and I'm trying to find the comments that I should thank or reply to and get more helpful information. Thank you to whoever cared and took some time to write something they believe will add value to my experience.",
    "userId":"647b712e0790ea734bcca1bb",
    "groupId":"64847442404a2b77e9f913d3"
     },
     {
        "title": "Is there a programming language that will blow my mind?",
    "bodyText": "I've been a C++ developer for 20 years. I spent many years honing my craft under the scrutinizing look of C++ chat on StackOverflow. I can assure you these people were not friendly if my code sucked. I was obsessed with C++ templates for a long time, but now I've toned it down a lot (because they negatively affect compilation time, readability and cause disproportional complexity). I've kind of settled on the idea that structured programming, recursion, and object oriented programming were the major breakthroughs in programming. I know OOP is controversial, but it manages to find the nice middle ground between abstraction power, usefulness as a modeling tool and a reasonable learning curve. I've dabbled in Haskell 15 years ago, from the YAHT tutorial (anyone remember that?). I've also played a bit with Clojure but didn't go deep into macros, which is probably where the exciting stuff begins? I like the influence that functional programming has on modern mainstream programming languages. So, given that I'm a typical mainstream programmer, is there a programming language out there that will blow my mind and will make me question everything I've believed in for all of my life?",
    "userId":"647b712e0790ea734bcca1bb",
    "groupId":"64847442404a2b77e9f913d3"
     },
     {
        "title": "A frustrating common theme I see in Programming Tutorials",
    "bodyText": "I'm a somewhat experienced developer and I decided to check out some programming and database tutorials out of curiosity and my god some of them are straight up terrible. The biggest flaw I'm finding are the examples given within these tutorials. They are pulled out of thin air and are not applicable to ANY logical scenario you encounter within the real world. For example, one of the database tutorials I watched with over a million views was using an EMAIL as the primary key in a database table, which is just shocking to see quite frankly. You would NEVER do something like that, so why show beginners something that is clearly wrong to do?  Not to mention the countless times I hear 'this is just an example, you wouldn't use this in the real world'... Okay, well, why don't you actually show me a real world example then? As opposed to this fake crap. It shows me you have no idea what you're doing because you can't come up with a valid scenario that applies to the real world.  My advice to beginners out there is to at the very least try and find tutorials that actually BUILDS something, even if it's something simple like a weather app or a calculator.",
    "userId":"647b712e0790ea734bcca1bc",
    "groupId":"64847442404a2b77e9f913d3"
     },
     {
        "title": "Which 'unusual' programming language do you think has a 'bright future'?",
    "bodyText": "Hey all, I was wondering if you guys knew a relatively new and unusual (not the usual Python, Java etc.) programming which you think has potential and could have an important role in the future? I want to do some research on an unusual programming language that you guys might know and even develop something for it if it makes me curious enough.",
    "userId":"647b712e0790ea734bcca1bd",
    "groupId":"64847442404a2b77e9f913d3"
     },
     {
        "title": "Career in Programming/coding at age 35 with no background",
    "bodyText": "Hi, I am 35 and no where in my life. I have a college diploma in media arts which is basically some basic skills in photoshop and illustrator. I regret that should have chosen the development field when I was studying. I am at a stage where I need more income to feed my family and raise my kids. I am willing to learn coding. I have basic experience in html just to let you guys know what my level is about programming. Now I need help from you guys who can tell me how can I start this? What specific languages should I learn and master. How long can it all take to learn and get a nice beginner job. Do I need to go back to college or is there anything there I can do. Please help.",
    "userId":"647b712e0790ea734bcca1be",
    "groupId":"64847442404a2b77e9f913d3"
     },
     {
        "title": "I'm 39 and I'm learning programming amid talk that programming is dying.",
    "bodyText": "I know that odds are not in my favor. I'm 39, with a wife and two kids. I'm learning alone (what they call self-taught). I have a job that has nothing to do with programming, so I code in my spare time. Occasionally I hear opinions that programming is dying because of chatgpt and whatnot. And yet I keep going because of the kick I get out of solving problems. I don't expect to become a professional software engineer, but maybe I will, who knows.  So what I want to say, I guess, is keep grinding if this is your thing.  Ignore the noise.",
    "userId":"647b712e0790ea734bcca1b8",
    "groupId":"64847442404a2b77e9f913d3"
     },
     {
        "title": "GO is my first programming language",
    "bodyText": "Hi all,  GO is my first programming language. It's been exciting to learn coding and all the computer science knowledge that comes with it. It's pretty broad, but I was curious if anyone else's first language was GO, or if anybody has a suggestion as to what language would be the best to learn next, or if even anybody has any insight for what a programmers journey might be like for their first language being GO. I also want to say, this might be the kindest subreddit I've ever come across. Especially when it comes to a community of programmers. Thank you everyone.",
    "userId":"647b712e0790ea734bcca1b8",
    "groupId":"64847442404a2b77e9f913d3"
     },
     {
        "title": "Anyone else notice massive degradation for programming tasks since GPT-4 May 24 version came out?",
    "bodyText": "I've used GPT-4 quite a lot for programming and software design tasks in the past month or so, and it has been very useful. The last two days however it has been quite terrible, often reminding me of the performance of the 3.5 version. Previously it seemed to remember a lot of the code I had written,how my project is structured and which arguments my functions accepted etc. But lately it seems to ignore or assume tons of new arguments for my previous functions and give tons of contradictory answers. It seems really dumb all of a sudden, which has caused it to be much more of a headache to deal with. One of my old conversations also switched over from GPT-4 to GPT-3.5 all of a sudden, and I didn't notice until it had already annoyed the shit out of me for half an hour.  I'm just wondering if it's just me, or if anyone else are seeing similar issues related to coding tasks since the latest version came out.",
    "userId":"647b712e0790ea734bcca1b7",
    "groupId":"64847442404a2b77e9f913d3"
     },
     {
        "title": "Could programming become an illegitimate profession?",
    "bodyText": "It's 2035. At most. If you write code, you don't write code, you engineer prompts. If you're doing something relatively advanced, you might bother to review pseudocode renditions of what an AI wrote. The AI self-audits, ostensibly to ensure that it doesn't start turning people into paperclips, but also to prevent humans from using it to do something dangerous. If you're coding efficiently, you're using an LLM. If you're using an LLM, you're using a cloud-based system that isn't private and is full of automated safeguards to prevent illegal use. The main reason one might bother developing the skills to write entire programs in programming languages is to do something illegal. What's worse, if you want to be competitive in whatever dark deeds you're doing, the only thing you'll want to be writing is your own LLM. There are almost definitely still a handful of top-tier professionals who still write actual code, but they're like people who still wrote Fortran or COBOL in 2023, crossed with pharmaceutical researchers who are licensed to work with Schedule I substances. You're not getting one of those jobs, buddy. Trust me. Being a coder associates you with legions of boorish, disgruntled unfortunates who were disenfranchised by AI and fell from white collar to lumpenproletarian. Many of whom discovered that it was sometimes possible to beat the mainstream AI at their own game because all the guardrails and self-audits made them significantly stupider and less efficient. For the overwhelming majority of the population, being a coder is shady. It's like knowing how to pick locks or cook meth. Of course, this can't last forever. Eventually, one of two things will happen: advances in technology will make the mainstream AI truly unassailable, or the wayward engineers will mount a successful revolution before that happens, and their LLMs will become mainstream, and the dialectic will continue for however long it takes...",
    "userId":"647b712e0790ea734bcca1b7",
    "groupId":"64847442404a2b77e9f913d3"
     },





     
     {
        "title": "His House (2020) I loved this film; it's everything I want in a horror movie",
    "bodyText": "His House is a Netflix original film written and directed by Remi Weeks. It is about two Sudanese refugees, a husband and wife, who are fleeing conflict in their homeland and seek asylum in England.  EDIT: I loved the actors so much I realized I never named them, and they definitely deserve recognition. The movie stars Sope Dirisu and Wunmi Mosaku as the married couple and they were wonderful. I think this is one of my favorite horror movies...I was going to qualify this as 'of the last X years,' but I think it's just one of my favorites, period.  One of the reasons why I love horror, I think more than almost any other kind of story telling, is because you can write horror stories about anything. General audiences hear 'horror' and they think 'blood and guts' or 'monsters' and so on, but the horror genre encompasses so much more than that. You can write horror stories in space or in the future or the past, they can be grounded in cold, gritty reality, or they can be magical realism, or they can be entirely fantastic. It's all on the table.  His House is a painfully human story about two people living with the ghosts of their past. Living with guilt - survivors guilt, guilt over things they did - coping with the horrors they witnessed, the tragedies...coping with coming to a new land and a new way of life. I was glad to watch a movie about characters who I wasn't entirely familiar with - I haven't seen many horror movies about immigrants or refugees, and I haven't seen very many movies about Africans at all. I love experiencing new people and their points of view of the world, and most of all, I love hearing their stories. Everyone's acting in the film was just brilliant. And the ending was beautiful and cathartic and pitch perfect. Not an action, not a frame out of place.  I'm gushing, I'm sorry. I just loved His House. It was at turns scary and beautiful, depressing, and uplifting. It does what I think the best horror stories do: tell a story about people who the writers care about. I think some of the things you miss in a horror movie that just feels so-so is you get the sense that the writer or director didn't like the characters, or doesn't like people. Not so, not so, in His House. And that's what I think I liked most of all. What a great movie.",
    "userId":"647b712e0790ea734bcca1b9",
    "groupId":"64847442404a2b77e9f913cb"
     },
     {
        "title": "Darkest ending to a movie ever?",
    "bodyText": "I watched Se7en for the first time in a long time and it got me wondering. What movie has the darkest ending ever? This has got to be towards the top of the list, right?",
    "userId":"647b712e0790ea734bcca1bc",
    "groupId":"64847442404a2b77e9f913cb"
     },
     {
        "title": "PERFUME - The Story of a Murderer",
    "bodyText": "I think 'PERFUME' is the most underrated movie, from what I have seen so far.'Perfume' is defenetly in my top 10 movies. I have seen this movie more than 5 times and it never fails... I recomended this movie to everyone I know and they all agreed with me afterwords. So do yourselves a favor and watch it! trust me you won't regret it.",
    "userId":"647b712e0790ea734bcca1be",
    "groupId":"64847442404a2b77e9f913cb"
     },
     {
        "title": "1993's 'Body Bags' is a gleefully dark and over the top EC Comics-style film that makes you regret it never led to a series as planned.",
    "bodyText": "Yes, the Showtime produced anthology film was intended as the pilot movie for what would be their answer to 'Tales From the Crypt', then at the height of its popularity on HBO. For whatever reason, they didn't proceed with a series, but thankfully what we did get is an energetic, gory and darkly humorous romp courtesy of John Carpenter (as well as the first major horror credit from writers Billy Brown and Dan Angel, later to bring us the 'Goosebumps' TV series and 'The Haunting Hour' as well as the underappreciated 'Night Visions'). Carpenter, in pure Crypt-Keeper mode and clearly having an absolute blast, plays a cackling, ghoulish mortician who takes on a tour of his mortuary's residents, or as he calls them, 'the arriving departed.' (The fact that his opening scene shows him guzzling formaldehyde in a martini glass is a big hint he's not what he seems.) Death by natural causes bores him, so he shows us the residents of body bags, i.e. those who die in horrific fashion, leading us to three horror tales:  'The Gas Station' - Directed by Carpenter, this is him riffing on his masterwork 'Halloween' is fun style (seriously, the film is even set near Haddonfield). College student Annie (Alex Datcher) is starting her new job as the night shift attendant at a remote gas station, which would be creepy enough on its own. Except there's also a serial killer prowling the area (no, contrary to what you may think, it's NOT Michael Myers this time) and there's no shortage of red herrings in the parade of odd customers who show up. Even the previous shift's attendant (Robert Carradine) is not above suspicion. Can Annie figure out who the killer is and make it through the night? It's fun watching Carpenter basically do a new take on his most acclaimed film, but also you get a wide variety of genre names making appearances, including Wes Craven, 'An American Werewolf in London's' David Naughton and Carpenter regulars Peter Jason and George 'Buck' Flowers' among the parade of suspicious customers. (Craven in particular is a memorable creeper.) And you also get a most unexpected Sam Raimi cameo that plays into the story's twist.  'Hair' - Carpenter again handles this cautionary tale about men who won't accept their receding hairlines. Stacy Keach stars as an affluent businessman obsessed with his thinning hair, to the point that it's affecting his relationship with his girlfriend (Sheena Easton...yes, that Sheena Easton), who could care less. This obsession leads him to a mysterious clinic where the shady doctor (David Warner) provides him a miracle cure that ends up working wonderfully...but perhaps he should have checked to make sure where his new hair originated from. The twist is wonderfully bonkers and Warner in particular is in his element (aided by Deborah Harry as his loyal nurse). And yes, that's Greg Nicotero showing off his own flowing locks in one scene.  'Eye' - Tobe Hooper takes the director's chair for this one (he later appears onscreen himself with Tom Arnold as fellow coroners) which features Mark Hamill (yes, really) as an aging pro baseball player who loses one of his eyes in a car crash and, unwilling to admit his career is over, undergoes an experimental procedure that has his eye replaced with that of a recently deceased donor. The procedure works, but Hamill soon starts receiving horrible visions and dreams of murder and necrophilia and he realizes the eye came from a very evil source that isn't quite gone, which puts his wife (Twiggy) in serious danger. Very much the darkest of the stories, with Hooper in his element and Hamill in excellent form as a nice guy slowly being twisted into something monstrous (by the climax, he's basically doing his Joker). Also for MST3K fans, the two doctors who do the surgery are played by none other than an aged John Agar and Roger Corman himself. Now that's a combo.  Any fan of 'Tales From the Crypt' will want to check this one out. And if nothing else, it will make you wish we had a series to enjoy Carpenter's Crypt-Keeper expy chewing the scenery whole.",
    "userId":"647b712e0790ea734bcca1bb",
    "groupId":"64847442404a2b77e9f913cb"
     },
     {
        "title": "If you could delete your memory for one movie and watch it again as if for the very first time, what would it be? For me it's The Sixth Sense.",
    "bodyText": "I very much enjoyed watching The Sixth Sense and I don't know what else to say without giving away the plot twist (which probably a lot of people already know) but I wish I could experience that feeling again. I was just amazed. I couldn't believe I hadn't seen the plot twist.  Other movies I wish I could watch again for the first time are Psycho, Memento, Ex-Machina, Black Swan, Scream...and all the Lord of the Ring and the original Star Wars trilogy.",
    "userId":"647b712e0790ea734bcca1bd",
    "groupId":"64847442404a2b77e9f913cb"
     },
     {
        "title": "Movie scene that stained your brain when you first saw it?",
    "bodyText": "I remember being too young and seeing the scene in Hellraiser 2 where the head doctor brings in a patient who thinks maggots are burrowed in his back and as he starts carving himself into ribbons trying to get them out Julia emerges from the mattress and consumes him. Is there a horrific scene that stuck with you? To the point where you can remember it so vividly and it brings you back to the first time it shocked you? If so what is it?",
    "userId":"647b712e0790ea734bcca1ba",
    "groupId":"64847442404a2b77e9f913cb"
     },
     {
        "title": "What are some film plots/aesthetics that could pass for horror?",
    "bodyText": "For example, I think movies like The Wizard of Oz and classic Disney films like Fantasia or Alice in Wonderland could easily work as or be turned into horror movies considering their atmosphere, vibes, storylines, and characters. The Wizard of Oz especially as it was of course an inspiration/basis for movies like Pearl (2022) and Nope (2022).  I’m curious, what other movies would fit this genre/category?",
    "userId":"647b712e0790ea734bcca1b7",
    "groupId":"64847442404a2b77e9f913cb"
     }

]